app/views/carts/show.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 1
---
<table border="0" cellspacing="5" cellpadding="5">
	<% @cart.line_items.each do |item| %>