app/controllers/home_controller.rb

  def index
    @last_four_products = Product.find(:all, :limit=>4, :order=>"id DESC")

    #for now the last product but you're going to want the concept
    #of a featured product

    @featured_product = Product.find(:last)

    if Product.where(:is_featured => true).exists then
---
SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."is_featured" = 't' LIMIT 1