app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 24 Feb 2012 05:38:27 UTC +00:00], ["updated_at", Fri, 24 Feb 2012 05:38:27 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 27], ["created_at", Sun, 26 Feb 2012 11:05:13 UTC +00:00], ["order_id", nil], ["product_id", 2], ["quantity", 1], ["updated_at", Sun, 26 Feb 2012 11:05:13 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-02-24 10:34:16.117250' WHERE "line_items"."id" = 3
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save