app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "description", "image_url", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "products" SET "description" = 'It is sixty years in the future. Humanity has survived the ravaging effects of a climate change and is making its first tentative steps out into near space through the combined efforts of the International Space Consortium. Callum Moore has come from a troubled past to graduate top of his class at the ISC flight academy and has been selected to pilot the Icarus in mankind’s first attempt at faster than light travel.